<details>
<summary> Sample plan with `environment == Staging && OrgAWSBackup == Disabled` </summary>

```
Terraform used the selected providers to generate the following execution plan. Resource actions
are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_db_parameter_group.postgres_14 will be created
  + resource "aws_db_parameter_group" "postgres_14" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + family      = "postgres14"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = (known after apply)
      + tags        = (known after apply)
      + tags_all    = (known after apply)
    }

  # aws_security_group.postgres will be created
  + resource "aws_security_group" "postgres" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = (known after apply)
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-0aa598f453813a32a"
    }

  # module.pg_14_name.random_id.this will be created
  + resource "random_id" "this" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {}
      + prefix      = "acdugct-restore-postgres-"
    }

  # module.postgres.aws_db_instance.this will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = true
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = false
      + availability_zone                     = (known after apply)
      + backup_retention_period               = 7
      + backup_window                         = "17:00-19:00"
      + ca_cert_identifier                    = "rds-ca-2019"
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = true
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = "acd-staging-default-db-subnet-group"
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + endpoint                              = (known after apply)
      + engine                                = "postgres"
      + engine_version                        = "14.7"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = (known after apply)
      + instance_class                        = "db.t4g.micro"
      + iops                                  = 3000
      + kms_key_id                            = "arn:aws:kms:ap-southeast-1:143918248843:key/ee538dac-78a7-446a-bb19-76a81065da9a"
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = "mon:20:00-mon:20:30"
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      + max_allocated_storage                 = 0
      + monitoring_interval                   = 60
      + monitoring_role_arn                   = "arn:aws:iam::143918248843:role/service-role/monitoring.rds.amazonaws.com/ServiceRoleForMonitoring_rds-enhanced-monitoring-b720325c78613b"
      + multi_az                              = false
      + name                                  = (known after apply)
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = 5432
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = "aprugct-postgres-01-to-be-applied"
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = (known after apply)
      + tags_all                              = (known after apply)
      + timezone                              = (known after apply)
      + username                              = "aprugct_admin"
      + vpc_security_group_ids                = (known after apply)
    }

  # module.postgres.random_id.db_identifier will be created
  + resource "random_id" "db_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + prefix      = "acdugct-restore-postgres-"
    }

  # module.postgres.random_id.password will be created
  + resource "random_id" "password" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # module.sg_name.random_id.this will be created
  + resource "random_id" "this" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {}
      + prefix      = "acdugct-restore-postgres-"
    }

Plan: 7 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + address           = (known after apply)
  + arn               = (known after apply)
  + id                = (known after apply)
  + org_backup_policy = "Disabled"
  + password          = ""
  + security_group_id = (known after apply)

────────────────────────────────────────────────────────────────────────────────────────────────
```

</details>
